<!-- dflook/terraform-github-actions {"workspace":"import-warnings","backend_type":"remote","plan_modifier":"9ebdcefa28ba58bd0b2d6fc795d575dba5541517ae08f41ba0945779d06b671e","backend":"952670b39827ca0e48055aeae2746f2bebe6ea0a1273a28ebb31574f6fdc4d52","plan_job_ref":"Job Test actions using target, replace, and exclude #18 at https://github.com/dflook/terraform-github-actions/actions/runs/16829763929","plan_hash":"b8a92d94cb19521da4a0e8629723c07e8463c530930f1f47517b3a7dd1bacd6c","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__ in the __import-warnings__ workspace
Targeting resources: `random_string.foreach["hello"]`
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  foreach = "G9NPaKD2u6" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:white_check_mark: Plan applied in [Test actions using target, replace, and exclude #18](https://github.com/dflook/terraform-github-actions/actions/runs/16829763929)
<details open><summary>Outputs</summary>

```hcl
count   = "YSva7iynkt"
foreach = "6jyj9gYzMQ"
```
</details>